.config/doom/config.el
  (require 'ess-r-mode)
  ;;(require 'ess-view-data)
  ;; (require 'ess-site)
  ;; (require 'ess-rutils)
  ;; Auto set width and length options when initiate new Ess processes
  :config
  (add-hook 'ess-post-run-hook 'ess-execute-screen-options)
  (add-hook 'ess-mode-hook (lambda () (run-hooks 'prog-mode-hook)))
  (add-hook 'ess-mode-hook ;; truncate lines to make tables easier to view
            (lambda () (toggle-truncate-lines t)))
  (add-hook 'ess-mode-hook
            (lambda () (ess-set-style 'RRR 'quiet)
              (add-hook 'local-write-file-hooks
                        (lambda () (ess-nuke-trailing-whitespace)))))
  (add-hook 'inferior-ess-mode-hook 'ansi-color-for-comint-mode-on)
  (add-hook 'inferior-ess-mode-hook #'(lambda ()
                                        (setq-local comint-use-prompt-regexp nil)
                                        (setq-local inhibit-field-text-motion nil)))
  (add-hook 'ess-r-mode-hook
            (lambda()
              'eglot-ensure
              (make-local-variable 'company-backends)
              (delete-dups (push 'company-capf company-backends))
              (delete-dups (push 'company-files company-backends))))
  (add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
  (show-paren-mode)
  ;;(setq ess-eval-empty t)               ; don't skip non-code line
  (setq comint-scroll-to-bottom-on-input 'this)
  (setq comint-move-point-for-output 'others)
  ;;(setq ess-ask-for-ess-directory nil)
  (setq ess-eval-visibly 'nowait)
  (setq ess-use-flymake nil)
  ;; (setq ess-r-flymake-linters '("infix_spaces_linter" . "commas_linter"))
  (setq ess-roxy-fold-examples nil)
  (setq ess-roxy-fontify-examples t)
  (setq ess-use-company 'script-only)
  (setq ess-company-arg-prefix-length 1)
  ;;(setq ess-blink-region nil)

  (setq ess-r-flymake-lintr-cache nil)
  (setq ess-history-directory "~/.R/")
  (setq inferior-R-args "--no-restore-history --no-save")
  (setq ess-offset-arguments 'prev-line)

  (setq ess-indent-with-fancy-comments nil)

  ;; fix assignment key
  (ess-toggle-underscore nil)
  (setq ess-insert-assign (car ess-assign-list))
  (setq ess-assign-list '(" = "))
  (bind-key "M--" 'ess-insert-assign)

  (setq ess-eldoc-show-on-symbol nil)
  ;; This may cause massive slow downs?
  (setq ess-eldoc-abbreviation-style nil)
  ;;(setq ess-use-eldoc nil)
  (setq comint-scroll-to-bottom-on-output t)
  :general
  (global-leader
   :major-modes
   '(ess-r-mode inferior-ess-r-mode t)
   :keymaps
   '(ess-r-mode-map inferior-ess-r-mode-map)
   "e" '(:ignore e :which-key "eval")
   "eb" '(ess-eval-buffer :which-key "buffer")
   "ed" '(eval-buffer-from-beg-to-here :which-key "buffer from beg")
   "ee" '(eval-buffer-from-here-to-end :which-key "buffer to end")
   "el" '(ess-eval-region-or-line-and-step :which-key "line or region")
   "ef" '(ess-eval-function-or-paragraph-and-step :which-key "function or paragraph")
   "er" '(polymode-eval-region-or-chunk :which-key "Rmd region or chunk")
   "eB" '(polymode-eval-buffer-from-beg-to-point :which-key "Rmd chunks from beg to point")
   "eE" '(polymode-eval-buffer-from-point-to-end :which-key "Rmd chunks from point to end")
   "r" '(:ignore r :which-key "Rmd")
   "rb" '(efs/ess-bookdown :which-key "bookdown-export")
   "rx" '(efs/ess-xaringan :which-key "xaringan-export")
   "re" '(efs/ess-rmarkdown :which-key "Rmd-export")
   "rs" '(efs/ess-rshiny :which-key "shiny-export")
   "rd" '(efs/ess-publish-rmd :which-key "publish Rmd")
   "rn" '(polymode-next-chunk :which-key "next chunk")
   "rp" '(polymode-previous-chunk :which-key "previous chunk")
   "rk" '(polymode-kill-chunk :which-key "kill chunk")
   "rl" '(markdown-insert-link :which-key "insert link")
   "ri" '(markdown-insert-image :which-key "insert image")
   "d" '(ess-doc-map :which-key "docs")
   ;;"c" '(ess-r-mode-map :which-key "ess r map") ; doesn't work - maybe command?
   "i" '(:ignore i :which-key "insert")
   "ii" '(efs/insert-r-in :which-key "%in%")
   "id" '(efs/insert_double_assign_operator :which-key "<<-")
   ";" '(ess-insert-assign :which-key "<-")
   "p" '(efs/insert-r-pipe :which-key "insert %>%")
   "v" '(ess-rdired :which-key "rdired")
   "w" '(ess-set-working-directory :which-key "set wd")))
;; :bind (:map ess-r-mode-map
;;             ("C-c C-w w" . ess-r-package-use-dir)
;;             ("C-c C-w C-w" . ess-r-package-use-dir)
;;             ("<C-M-return>" . ess-eval-region-or-function-or-paragraph-and-step)
;;             ("<C-S-return>" . ess-eval-buffer)
;;             ("C-M-;" . comment-line)
;;             ("C-S-<f10>" . inferior-ess-reload)
;;             ("<f5>" . ess-display-help-on-object)
;;             ("<C-return>" . ess-eval-region-or-function-or-paragraph))
;; :bind (:map inferior-ess-mode-map
;;             ("C-S-<f10>" . inferior-ess-reload)))

;; An example of window configuration:
(setq display-buffer-alist
      '(("*R Dired"
         (display-buffer-reuse-window display-buffer-at-bottom)
         (window-width . 0.5)
         (window-height . 0.25)
         (reusable-frames . nil))
        ("*R"
         (display-buffer-reuse-window display-buffer-in-side-window)
         (side . right)
         (slot . -1)
         (window-width . 0.5)
         (reusable-frames . nil))
        ("*Help"
         (display-buffer-reuse-window display-buffer-in-side-window)
         (side . right)
         (slot . 1)
         (window-width . 0.5)
         (reusable-frames . nil))))
;; syntax highlight
(setq ess-R-font-lock-keywords
      (quote
       ((ess-R-fl-keyword:modifiers . t)
        (ess-R-fl-keyword:fun-defs . t)
        (ess-R-fl-keyword:fun-defs2 . t)
        (ess-R-fl-keyword:keywords . t)
        (ess-R-fl-keyword:assign-ops)
        (ess-R-fl-keyword:constants . t)
        (ess-fl-keyword:fun-calls . t)
        (ess-fl-keyword:numbers . t)
        (ess-fl-keyword:operators)
        (ess-fl-keyword:delimiters)
        (ess-fl-keyword:=)
        (ess-fl-keyword::= . t)
        (ess-R-fl-keyword:F&T)
        (ess-R-fl-keyword:%op%))))

(setq inferior-ess-r-font-lock-keywords
      (quote
       ((ess-S-fl-keyword:prompt . t)
        (ess-R-fl-keyword:messages . t)
        (ess-R-fl-keyword:modifiers . t)
        (ess-R-fl-keyword:fun-defs . t)
        (ess-R-fl-keyword:fun-defs2 . t)
        (ess-R-fl-keyword:keywords . t)
        (ess-R-fl-keyword:assign-ops)
        (ess-R-fl-keyword:constants . t)
        (ess-fl-keyword:matrix-labels)
        (ess-fl-keyword:fun-calls)
        (ess-fl-keyword:numbers)
        (ess-fl-keyword:operators)
        (ess-fl-keyword:delimiters)
        (ess-fl-keyword:=)
        (ess-fl-keyword::= . t)
        (ess-R-fl-keyword:F&T))))

(use-package polymode)
(use-package poly-R)
(use-package poly-markdown
  :config
  (add-to-list 'auto-mode-alist '("\\.rmd" . poly-markdown+R-mode))
  )
(with-eval-after-load "markdown"
  (use-package poly-markdown))
;; (with-eval-after-load "org"
;;   (use-package poly-org))
