.config/doom/config.org
* Spelling
** Hunspell
#+begin_src shell :tangle (if (file-exists-p "/usr/share/myspell/en-custom.dic") "no" "setup.sh")
cd /tmp
curl -o "hunspell-en-custom.zip" 'http://app.aspell.net/create?max_size=80&spelling=GBs&spelling=AU&max_variant=0&diacritic=keep&special=hacker&special=roman-numerals&encoding=utf-8&format=inline&download=hunspell'
unzip "hunspell-en-custom.zip"

sudo chown root:root en-custom.*
sudo mv en-custom.{aff,dic} /usr/share/myspell/
#+end_src

** Aspell
#+begin_src shell :tangle (if (file-expand-wildcards "/usr/lib64/aspell*/en-custom.multi") "no" "setup.sh")
cd /tmp
curl -o "aspell6-en-custom.tar.bz2" 'http://app.aspell.net/create?max_size=80&spelling=GBs&spelling=AU&max_variant=0&diacritic=keep&special=hacker&special=roman-numerals&encoding=utf-8&format=inline&download=aspell'
tar -xjf "aspell6-en-custom.tar.bz2"

cd aspell6-en-custom
./configure && make && sudo make install
#+end_src

*** Configuration
#+begin_src emacs-lisp
(setq ispell-dictionary "en-custom")
#+end_src
Oh, and by the way, if ~company-ispell-dictionary~ is ~nil~, then
~ispell-complete-word-dict~ is used instead, which once again when ~nil~ is
~ispell-alternate-dictionary~, which at the moment maps to a plaintext version of
the above.

It seems reasonable to want to keep an eye on my personal dict, let's have it
nearby (also means that if I change the 'main' dictionary I keep my addition).
#+begin_src emacs-lisp
(setq ispell-personal-dictionary (expand-file-name ".ispell_personal" doom-private-dir))
#+end_src

Regions to be ignored by ispell. For .Rmd files
https://superuser.com/questions/345084/how-to-exclude-in-flyspell-mode-and-flyspell-buffer
https://emacs.stackexchange.com/questions/44132/mmm-mode-and-flyspell
https://emacs.stackexchange.com/questions/36011/make-flyspell-avoid-checking-includes-in-c
https://stackoverflow.com/questions/4671908/how-to-make-flyspell-bypass-some-words-by-context
https://stackoverflow.com/questions/8287330/exempt-code-chunks-in-an-sweave-document-from-emacs-spell-check
https://stackoverflow.com/questions/28942860/emacs-flyspell-disable-for-custom-latex-macros

#+begin_src emacs-lisp :tangle no
(after! ispell
  (pushnew! ispell-skip-region-alist
            '("^```" . "```$")
            '("^`" . "`$")
            '("^[" . "]$")
            '("^{" . "}$"))
  )
#+end_src

** Grammar

I don't like the highlighting the grammar module applies

#+begin_src emacs-lisp
(setq writegood-mode nil)
#+end_src
