.config/doom/config.el

(setq ispell-dictionary "en-custom")

(setq ispell-personal-dictionary (expand-file-name ".ispell_personal" doom-private-dir))
